app/controllers/admin_controller.rb

	def posts
		@posts = Post.all
---
SELECT "posts".* FROM "posts"