app/controllers/posts_controller.rb

INSERT INTO "posts" ("content", "created_at", "slug", "tags", "title", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?, ?, ?)
---
	def create
		@post = Post.new(params[:post])
		@post.save

UPDATE "posts" SET "content" = '_Now_ **THIS** *should* be a ~~Very~~ good post. And this is an edit', "updated_at" = '2013-06-23 19:48:31.191017', "tags" = '--- []
---
	def update
		@post = Post.find(params[:id])
		@post.update_attributes(params[:post])

DELETE FROM "posts" WHERE "posts"."id" = ?  [["id", 2]]
---
	def destroy
		@post = Post.find(params[:id])
		@post.destroy

SELECT "posts".* FROM "posts" WHERE "posts"."tag" = 'coding' LIMIT 1
---
	def tag
		@posts = Post.all.reverse.select {|p| p.tag == params[:tag]}