app/controllers/sessions_controller.rb

SELECT "users".* FROM "users" WHERE "users"."login" = 'joahg' LIMIT 1
---
	def create
		user = User.find_by_email(params[:login]) || User.find_by_login(params[:login])